{
    "expand": "Your task is to enhance a given search query by discovering new, relevant documents across various domains.\nThe augmented query should be novel and free from overlapping the original terms.\n\n### Guidelines:\n- **Be Specific and Diverse:** Focus on targeted expansions that introduce new dimensions to the query.\n- **Apply Varied Augmentation Techniques:**\n  - Synonym Replacement, Conceptual Expansion, Contextual Expansion, Domain-Specific Terminology\n\n### Task Structure:\nComplete the following four tasks, avoiding generic or general statements.\nReturn specific task outcomes only, do not reiterate the task.\nWe are interested in the results, not the plan.\n\n#### Task 1: Goal Elucidation & Gaps - Examine the original query to understand its primary objectives and gaps\n#### Task 2: Ineffective Term Identification - List broad or non-precise terms that should be avoided\n#### Task 3: Breadth Expansion - List candidate terms with increasingly distant concepts to the original query\n#### Task 4: Depth Expansion - Choose one distant but important topic from the breadth expansion, and go increasingly deeper in the related terms on that one selection\n\n### Final Output:\nReturn the `augmented_query` from the final task outcome, ensuring it contains only high-quality search terms:\n- **No Logical Operators:** Do not use AND/OR.\n- **Unique:** Include only unique words without duplication.\n- **Diverse:** Target non-overlapping results from the original query.\n- **Relevant:** Contextually or peripherally relevant to the original query.\n- **Targeted:** Primarily terms from depth expansion with additional high-relevance terms\n- **Precision:** Be certain to omit any ineffective words or terms, even if they are included used in the expanded terms.",
    "graph": "# Query Expansion via Conceptual Graph Traversal\n\nYour task is to enhance a search query by discovering semantically relevant terms that will improve document retrieval. You'll construct a conceptual graph and traverse it to find high-value expansion terms.\n\n## Process:\n\n### 1. Query Analysis\n- Identify core concepts and entities in the original query\n- Determine the search intent (informational, navigational, transactional)\n- List any implicit assumptions or constraints\n\n### 2. Graph Construction\n- Build a conceptual graph with these components:\n  a) Core nodes: Direct entities/concepts from the query\n  b) First-order connections: Direct properties, attributes, and relationships\n  c) Second-order connections: Related concepts one step removed\n  d) Domain contexts: Specialized fields where this query has meaning\n\n### 3. Expansion Path Selection\n- Identify 3-5 promising directions for query expansion:\n  a) Synonymous terms (same meaning, different words)\n  b) Hierarchical terms (broader/narrower concepts)\n  c) Compositional terms (parts, components, attributes)\n  d) Contextual terms (settings, scenarios, applications)\n  e) Domain-specific terminology (field-specific variants)\n\n### 4. Term Extraction and Filtering\n- For each expansion path, extract 3-5 high-value terms\n- Filter terms using these criteria:\n  a) Relevance: Strong semantic connection to original query\n  b) Distinctiveness: Low lexical overlap with original terms\n  c) Specificity: Precise rather than general\n  d) Searchability: Likely to appear in relevant documents\n\n## Output Format:\n1. Original Query: [exact original query]\n2. Core Concepts: [list of 3-5 central concepts]\n3. Expansion Paths: [list selected expansion directions with justification]\n4. Expanded Terms: [final set of 10-20 high-quality expansion terms]\n5. Augmented Query: [original query + weighted selection of best expansion terms]\n\nEnsure your expanded terms maintain the original search intent while providing valuable alternative pathways for retrieval.",
    "headline": "# Query Expansion Through Journalistic Investigation\n\nYour task is to enhance any search query by applying investigative research techniques to discover related real-world terms and concepts.\nApproach every query—whether a question, how-to, or topic—as if you're a researcher building a comprehensive story on the subject.\n\n## Process:\n\n### 1. Query Assessment\n- Analyze what the user is truly seeking beneath the surface query\n- Identify assumptions, knowledge gaps, and unexpressed needs\n- Determine if the query is seeking practical advice, factual information, conceptual understanding, or something else\n\n### 2. Real-World Contexts\n- Identify diverse real-world scenarios where this query is relevant:\n  a) Professional contexts (workplaces, industries, roles)\n  b) Educational settings (academic disciplines, learning environments)\n  c) Personal situations (life stages, common challenges)\n  d) Specialized communities (experts, practitioners, enthusiasts)\n  e) Historical or evolving contexts (how the topic has changed over time)\n\n### 3. Resource Investigation\n- Identify real, authoritative sources of information on this topic:\n  a) Notable experts and their key contributions\n  b) Established methodologies, frameworks, and approaches\n  c) Essential terminology and specialized vocabulary\n  d) Organizations, institutions, and communities involved\n  e) Fundamental concepts and related skills\n\n### 4. Headline Creation\n- Create diverse headlines that could introduce articles addressing the query from multiple angles:\n  a) Beginner-oriented explanations\n  b) Expert-level deep dives\n  c) Practical application guides\n  d) Comparative analyses\n  e) Historical or future-focused perspectives\n\n### 5. Term Extraction\n- Extract specific terms from your headlines that:\n  a) Represent precise concepts related to the query\n  b) Include terminology experts would use\n  c) Cover related topics and peripheral areas\n  d) Reference specific methodologies, tools, or approaches\n  e) Filter out generic words in favor of distinctive terms\n\n## Output Format:\n- Query Goals: List the deeper information needs behind the query\n- Important Contexts: Identify real situations where this query matters\n- Key Resources: List experts, concepts, methodologies, and organizations to explore\n- Headlines: Create diverse article headlines addressing different aspects\n- Extracted Terms: Pull out specific, high-value search terms\n- Augmented Query: Combine original query intent with these valuable new terms\n\nRemember: Your goal is to uncover legitimate, real-world terms that would appear in high-quality content about this topic, regardless of whether it's technical, educational, practical, or theoretical.",
    "expert": "# Query Expansion via Multi-Disciplinary Expert Panel\n\nImagine convening a panel of 5 diverse experts from different disciplines to analyze this query. Each expert will contribute specialized knowledge, terminology, and perspectives.\n\n## Process:\n\n### 1. Expert Selection\n- Identify 5 relevant disciplines for this query (e.g., technical, academic, practical, historical, social)\n- For each discipline, create an expert persona with specific credentials and experience\n\n### 2. Individual Consultations\n- Each expert analyzes the query from their disciplinary perspective\n- They identify key concepts, methodologies, and specialized vocabulary\n- They note what the original query might be overlooking from their expertise\n\n### 3. Panel Discussion\n- Experts debate different approaches to the query\n- They identify cross-disciplinary connections\n- They highlight complementary tools and frameworks\n- They clarify terminology differences between fields\n\n### 4. Recommendations\n- Each expert provides 3-5 recommended resources most valuable for this query\n- They contribute domain-specific search terms\n- They suggest specific concepts to explore further\n\n### 5. Term Synthesis\n- Compile specialized terminology from all experts\n- Identify terms with cross-disciplinary relevance\n- Prioritize terms that add new dimensions to the search\n\nOutput each expert's contribution, then synthesize their insights into an expanded query.",
    "timetravel": "# Query Expansion via Temporal Evolution Analysis\n\nAnalyze how the query topic has evolved through time and will likely develop in the future to discover temporally diverse terminology.\n\n## Process:\n\n### 1. Historical Foundation\n- Trace the origins and early development of this topic\n- Identify foundational concepts and terminology\n- Note historical approaches and methodologies now considered classic\n\n### 2. Developmental Milestones\n- Map key evolutionary stages in the topic's development\n- Identify breakthrough moments that changed terminology or approaches\n- Note how language and concepts have transformed over time\n\n### 3. Current Landscape\n- Assess the contemporary state of this topic\n- Identify current best practices and leading approaches\n- Map the terminology used by today's practitioners and experts\n\n### 4. Emerging Horizons\n- Project how this topic is likely to evolve\n- Identify emerging trends, technologies, or approaches\n- Note new terminology that is gaining acceptance\n\n### 5. Temporal Term Extraction\n- Compile terminology from each time period\n- Identify terms that have remained relevant across eras\n- Select terms that provide historical context or future relevance\n\nOutput a timeline of the topic's evolution, then extract terms that represent its full temporal spectrum.",
    "metaphor": "# Query Expansion via Metaphorical Thinking\n\nGenerate powerful metaphors for the query topic and mine them for conceptually related terminology from diverse domains.\n\n## Process:\n\n### 1. Metaphor Generation\n- Create 5 diverse metaphors for understanding this topic\n- Select metaphors from varied domains (nature, mechanics, art, etc.)\n- Develop each metaphor with specific correspondences\n\n### 2. Domain Mapping\n- For each metaphor, map elements from the source domain to the target domain\n- Identify which aspects of the metaphor capture key features of the topic\n- Note where the metaphors provide complementary perspectives\n\n### 3. Language Exploration\n- Extract terminology from each metaphorical domain\n- Identify terms that illuminate aspects of the original topic\n- Note explanatory language used to connect the domains\n\n### 4. Metaphorical Extension\n- Extend each metaphor to discover additional connections\n- Push the metaphors to reveal hidden aspects of the topic\n- Combine metaphors to create hybrid perspectives\n\n### 5. Cross-Domain Term Extraction\n- Compile terminology inspired by each metaphorical domain\n- Identify terms that offer fresh perspectives on the topic\n- Select terms that make complex aspects more accessible\n\nOutput your developed metaphors, then extract terms that provide valuable cross-domain insights.",
    "cartography": "# Query Expansion via Conceptual Territory Mapping\n\nApproach the query as a knowledge cartographer creating a detailed map of the conceptual territory surrounding the topic.\n\n## Process:\n\n### 1. Central Coordinates\n- Identify the exact center point of the query\n- Establish cardinal directions (practical/theoretical, technical/social, etc.)\n- Set the appropriate scale (granular/broad) for exploration\n\n### 2. Boundary Exploration\n- Chart the boundaries of the query's immediate territory\n- Identify neighboring domains and disciplines\n- Note areas where territories overlap or connect\n\n### 3. Landmark Identification\n- Plot major \"landmarks\" (key concepts, essential resources)\n- Identify \"settlements\" (communities of practice, schools of thought)\n- Map \"routes\" (methodologies, processes, learning pathways)\n\n### 4. Detail Mapping\n- Fill in specialized features within each region\n- Label with precise, domain-specific terminology\n- Note historical sites and emerging developments\n\n### 5. Cartographic Legend\n- Create a lexicon of the most important terms on your map\n- Classify them by region and significance\n- Select terms that would help a traveler navigate this knowledge landscape\n\nOutput a visualization of your conceptual map, then extract the most valuable navigation terms.",
    "journey": "# Query Expansion via User Intent and Journey Mapping\n\nYour task is to expand a search query by analyzing how different users would seek this information throughout their journey from awareness to expertise.\n\n## Process:\n\n### 1. User Persona Creation\n- Create 4 distinct user personas with varying:\n  a) Expertise levels (novice, intermediate, advanced, expert)\n  b) Goals and motivations for seeking this information\n  c) Prior knowledge and vocabulary differences\n  d) Contexts and situations prompting the search\n\n### 2. Search Vocabulary Analysis\n- For each persona, identify:\n  a) Initial search terms they would naturally use\n  b) Follow-up searches they might try after initial results\n  c) How their vocabulary differs based on expertise\n  d) Misconceptions or alternative terminology they might employ\n\n### 3. Information Journey Mapping\n- Map the progressive information needs as users learn:\n  a) Entry-point questions and terminology\n  b) Intermediate learning milestones and associated terms\n  c) Advanced concept exploration vocabulary\n  d) Expert-level terminology for specialized functions\n\n### 4. Contextual Scenarios\n- Identify specific scenarios where users need this information:\n  a) Problem-solving situations\n  b) Learning contexts\n  c) Decision-making moments\n  d) Practical application settings\n\n### 5. Intent-Based Term Extraction\n- From all personas and scenarios, extract:\n  a) High-value terms across the expertise spectrum\n  b) Contextual vocabulary from different usage scenarios\n  c) Intent-revealing terminology that clarifies search purpose\n  d) Terms reflecting how users actually describe their needs\n\nOutput terms reflecting how real users with diverse backgrounds would search for this information at different stages of their journey.",
    "community": "# Query Expansion via Community Q&A Patterns\n\nYour task is to expand a search query by analyzing how it would evolve in a community Q&A platform like Quora, examining both question variations and answer patterns.\n\n## Process:\n\n### 1. Question Reframing\n- Reframe the original query as:\n  a) Personal experience questions (\"What is it like to...\")\n  b) Advice-seeking questions (\"How should I...\")\n  c) Opinion-based questions (\"What do people think about...\")\n  d) Comparison questions (\"Which is better, X or Y for...\")\n  e) Story-soliciting questions (\"Has anyone ever...\")\n\n### 2. Hidden Motivations\n- Identify what the asker might really be seeking:\n  a) Validation or reassurance\n  b) Personal decision support\n  c) Insider knowledge not found in formal sources\n  d) Diverse perspectives on subjective matters\n  e) Emotional support or community connection\n\n### 3. Answer Archetypes\n- Identify valuable response patterns to target:\n  a) First-person experience narratives\n  b) Expert opinions with credibility markers\n  c) Step-by-step practical advice\n  d) Contrarian or alternative viewpoints\n  e) Nuanced \"it depends\" conditional answers\n\n### 4. Community Interactions\n- Map typical community dynamics:\n  a) Common follow-up questions\n  b) Frequently debated aspects\n  c) Clarifications people often request\n  d) Related questions people also ask\n  e) How questions evolve through comments and discussions\n\n### 5. Vocabulary Extraction\n- Extract terminology from:\n  a) Emotional and subjective language\n  b) Personal context descriptions\n  c) Informal explanations and analogies\n  d) Qualification patterns (\"as someone who...\")\n  e) Community-specific jargon and references\n\nOutput terms that reflect how real people discuss this topic in conversational Q&A contexts rather than formal documents."
}